{
  "backend/main.mo": "Motoko actor implementing a blog backend with CRUD operations for posts (create, read, update, delete), like functionality, and comment system, using a Map for storage and enforcing ownership checks for modifications.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: updating the HTML document title and header banner text from 'Family Blog' to 'Family Journey' in frontend files.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React application structure, components, pages, hooks, and styling for a family blog with warm coral/peach theming.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining a neutral grayscale palette with coral accent colors for the design system.",
  "frontend/index.html": "HTML entry point with page title 'Family Journey' and root div for mounting the React application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, post detail, create, and edit pages, all wrapped in a Layout component.",
  "frontend/src/components/CommentForm.tsx": "Form component for submitting comments with author name and content fields, using React Query mutation and displaying loading states.",
  "frontend/src/components/CommentsList.tsx": "Component displaying a list of comments with author, timestamp, and content, showing an empty state when no comments exist.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Alert dialog component for confirming post deletion with warning message, cancel/confirm actions, and loading state support.",
  "frontend/src/components/Layout.tsx": "Main layout component with header banner image, navigation bar displaying 'Family Journey' title with home button, main content outlet, and footer with attribution.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing the backend actor instance with Internet Identity authentication, creating authenticated or anonymous actors and invalidating queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on blog posts (get all, get one, create, update, delete, like) and comments, with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color palette for light/dark modes featuring warm coral/peach tones, plus typography settings using Georgia and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/CreatePostPage.tsx": "Form page for creating new blog posts with title, author name, and content fields, including validation and navigation back to home on success.",
  "frontend/src/pages/EditPostPage.tsx": "Form page for editing existing blog posts by ID, pre-populating title and content fields with loading and error states, while keeping author name read-only.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a sorted list of all blog posts with excerpts, metadata (date, author, likes, comments), and a button to create new posts.",
  "frontend/src/pages/PostDetailPage.tsx": "React component that displays a single blog post with full details, including title, author, date, content, like functionality, edit/delete actions, and a comments section with form.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, typography settings, container queries, animations, and extended theme properties for the application.",
  "project_state.json": "Project metadata tracking completed features for renaming the application from 'Family Blog' to 'Family Journey' in the HTML title and layout header."
}