{
  "backend/main.mo": "Main Motoko actor implementing a blog platform with posts (CRUD operations), likes, and comments functionality, including ownership checks and timestamp tracking.",
  "backend/migration.mo": "Migration module that transforms old post data structure (without likes/comments) to new structure by adding likes=0 and empty comments array.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: like button/count display, comments display, comment form, like count preview on home page, and React Query hooks for cache management.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 12 frontend files covering routing, pages, components, hooks, and styling with warm coral/peach color theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining warm neutral palette with coral accents.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Family Blog application.",
  "frontend/src/App.tsx": "TanStack Router setup defining four routes (home, post detail, create, edit) with Layout wrapper and type-safe router configuration.",
  "frontend/src/components/CommentForm.tsx": "Form component for submitting comments with author name and content fields, validation, loading states, and automatic form clearing on success.",
  "frontend/src/components/CommentsList.tsx": "Displays chronologically ordered comments with author, timestamp, and content, showing empty state when no comments exist.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable alert dialog component for confirming post deletion with warning message, cancel/confirm actions, and loading state support.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing header banner image, sticky navigation bar with home button, main content outlet, and footer with attribution link.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state, including AuthClient creation, identity persistence, and delegation validation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all blog post operations (CRUD, like, comment) using the actor from useActor, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm coral/peach color palette for light and dark modes, plus typography settings using Georgia and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the DOM.",
  "frontend/src/pages/CreatePostPage.tsx": "Page component for creating new blog posts with form validation for title, content, and author name fields, using shadcn/ui components and the useCreatePost mutation hook.",
  "frontend/src/pages/EditPostPage.tsx": "Page component for editing existing blog posts that fetches post data by ID, validates title and content fields, and uses the useUpdatePost mutation hook with loading and error states.",
  "frontend/src/pages/HomePage.tsx": "Home page component that displays a list of all blog posts sorted by publication date, with post previews, metadata (author, date), and navigation to create new posts or view post details.",
  "frontend/src/pages/PostDetailPage.tsx": "Post detail page component that displays full post content with like button, like count, delete/edit actions, and includes CommentsList and CommentForm components for comment functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (including coral, peach, cream), typography, container settings, animations, and design tokens using OKLCH color space.",
  "project_state.json": "Project state tracking file documenting existing features (like/comment display and forms) and pending feature requests (backend like/comment functionality) for a family blog application."
}